tiborsimon/embedded-tdd-headers/pic/8bit/pic18f63j90_tdd.h
#define LCDBIAS0                      522
#define PORTG_RG0                     523
#define C3OUTG                        524
#define TX2                           525
#define PORTG_RG1                     526
#define CK2                           527
#define VLCAP1                        528
#define RX2                           529
#define PORTG_RG2                     530
#define DT2                           531
#define VLCAP2                        532
#define PORTG_RG3                     533
#define SEG26                         534
#define PORTG_RG4                     535
#define REPU                          536
#define RG6                           537
#define RDPU                          538
#define RG7                           539
#define LATA                          540
#define LATA0                         541
#define LA0                           542
#define LATA1                         543
#define LA1                           544
#define LATA2                         545
#define LA2                           546
#define LATA3                         547
#define LA3                           548
#define LATA4                         549
#define LA4                           550
#define LATA5                         551
#define LA5                           552
#define LATA6                         553
#define LA6                           554
#define LATA7                         555
#define LA7                           556
#define LATB                          557
#define LB0                           558
#define LATB0                         559
#define LB1                           560
#define LATB1                         561
#define LB2                           562
#define LATB2                         563
#define LB3                           564
#define LATB3                         565
#define LB4                           566
#define LATB4                         567
#define LB5                           568
#define LATB5                         569
#define LB6                           570
#define LATB6                         571
#define LB7                           572
#define LATB7                         573
#define LATC                          574
#define LATC0                         575
#define LC0                           576
#define LATC1                         577
#define LC1                           578
#define LATC2                         579
#define LC2                           580
#define LATC3                         581
#define LC3                           582
#define LATC4                         583
#define LC4                           584
#define LATC5                         585
#define LC5                           586
#define LATC6                         587
#define LC6                           588
#define LATC7                         589
#define LC7                           590
#define LATD                          591
#define LATD0                         592
#define LD0                           593
#define LATD1                         594
#define LD1                           595
#define LATD2                         596
#define LD2                           597
#define LATD3                         598
#define LD3                           599
#define LATD4                         600
#define LD4                           601
#define LATD5                         602
#define LD5                           603
#define LATD6                         604
#define LD6                           605
#define LATD7                         606
#define LD7                           607
#define LATE                          608
#define LATE0                         609
#define LE0                           610
#define LATE1                         611
#define LE1                           612
#define LATE3                         613
#define LE3                           614
#define LATE4                         615
#define LE4                           616
#define LATE5                         617
#define LE5                           618
#define LATE6                         619
#define LE6                           620
#define LATE7                         621
#define LE7                           622
#define LATF                          623
#define LATF1                         624
#define LF1                           625
#define LF2                           626
#define LATF2                         627
#define LF3                           628
#define LATF3                         629
#define LF4                           630
#define LATF4                         631
#define LF5                           632
#define LATF5                         633
#define LF6                           634
#define LATF6                         635
#define LF7                           636
#define LATF7                         637
#define LATG                          638
#define LATG0                         639
#define LG0                           640
#define LATG1                         641
#define LG1                           642
#define LG2                           643
#define LATG2                         644
#define LATG3                         645
#define LG3                           646
#define LATG4                         647
#define LG4                           648
#define U1OD                          649
#define U2OD                          650
#define TRISA                         651
#define TRISA0                        652
#define TRISA_RA0                     653
#define TRISA1                        654
#define TRISA_RA1                     655
#define TRISA2                        656
#define TRISA_RA2                     657
#define TRISA3                        658
#define TRISA_RA3                     659
#define TRISA_RA4                     660
#define TRISA4                        661
#define TRISA_RA5                     662
#define TRISA5                        663
#define TRISA_RA6                     664
#define TRISA6                        665
#define TRISA_RA7                     666
#define TRISA7                        667
#define TRISB                         668
#define TRISB_RB0                     669
#define TRISB0                        670
#define TRISB_RB1                     671
#define TRISB1                        672
#define TRISB_RB2                     673
#define TRISB2                        674
#define TRISB_RB3                     675
#define TRISB3                        676
#define TRISB_RB4                     677
#define TRISB4                        678
#define TRISB_RB5                     679
#define TRISB5                        680
#define TRISB_RB6                     681
#define TRISB6                        682
#define TRISB_RB7                     683
#define TRISB7                        684
#define TRISC                         685
#define TRISC0                        686
#define TRISC_RC0                     687
#define TRISC1                        688
#define TRISC_RC1                     689
#define TRISC2                        690
#define TRISC_RC2                     691
#define TRISC3                        692
#define TRISC_RC3                     693
#define TRISC4                        694
#define TRISC_RC4                     695
#define TRISC5                        696
#define TRISC_RC5                     697
#define TRISC6                        698
#define TRISC_RC6                     699
#define TRISC7                        700
#define TRISC_RC7                     701
#define TRISD                         702
#define TRISD_RD0                     703
#define TRISD0                        704
#define TRISD_RD1                     705
#define TRISD1                        706
#define TRISD_RD2                     707
#define TRISD2                        708
#define TRISD_RD3                     709
#define TRISD3                        710
#define TRISD_RD4                     711
#define TRISD4                        712
#define TRISD_RD5                     713
#define TRISD5                        714
#define TRISD_RD6                     715
#define TRISD6                        716
#define TRISD_RD7                     717
#define TRISD7                        718
#define TRISE                         719
#define TRISE_RE0                     720
#define TRISE0                        721
#define TRISE1                        722
#define TRISE_RE1                     723
#define TRISE_RE3                     724
#define TRISE3                        725
#define TRISE_RE4                     726
#define TRISE4                        727
#define TRISE_RE5                     728
#define TRISE5                        729
#define TRISE_RE6                     730
#define TRISE6                        731
#define TRISE_RE7                     732
#define TRISE7                        733
#define TRISF                         734
#define TRISF_RF1                     735
#define TRISF1                        736
#define TRISF2                        737
#define TRISF_RF2                     738
#define TRISF_RF3                     739
#define TRISF3                        740
#define TRISF_RF4                     741
#define TRISF4                        742
#define TRISF_RF5                     743
#define TRISF5                        744
#define TRISF_RF6                     745
#define TRISF6                        746
#define TRISF7                        747
#define TRISF_RF7                     748
#define TRISG                         749
#define TRISG0                        750
#define TRISG_RG0                     751
#define TRISG1                        752
#define TRISG_RG1                     753
#define TRISG2                        754
#define TRISG_RG2                     755
#define TRISG_RG3                     756
#define TRISG3                        757
#define TRISG4                        758
#define TRISG_RG4                     759
#define CCP1OD                        760
#define CCP2OD                        761
#define SPIOD                         762
#define OSCTUNE                       763
#define TUN0                          764
#define TUN1                          765
#define TUN2                          766
#define TUN3                          767
#define TUN4                          768
#define TUN5                          769
#define PLLEN                         770
#define INTSRC                        771
#define PIE1                          772
#define TMR1IE                        773
#define TMR2IE                        774
#define SSPIE                         775
#define SSP1IE                        776
#define TXIE                          777
#define TX1IE                         778
#define RCIE                          779
#define RC1IE                         780
#define ADIE                          781
#define PIR1                          782
#define TMR1IF                        783
#define TMR2IF                        784
#define SSP1IF                        785
#define SSPIF                         786
#define TXIF                          787
#define TX1IF                         788
#define RCIF                          789
#define RC1IF                         790
#define ADIF                          791
#define IPR1                          792
#define TMR1IP                        793
#define TMR2IP                        794
#define SSPIP                         795
#define SSP1IP                        796
#define TX1IP                         797
#define TXIP                          798
#define RCIP                          799
#define RC1IP                         800
#define ADIP                          801
#define PIE2                          802
#define TMR3IE                        803
#define LVDIE                         804
#define BCLIE                         805
#define BCL1IE                        806
#define CMIE                          807
#define OSCFIE                        808
#define PIR2                          809
#define TMR3IF                        810
#define LVDIF                         811
#define BCL1IF                        812
#define BCLIF                         813
#define CMIF                          814
#define OSCFIF                        815
#define IPR2                          816
#define TMR3IP                        817
#define LVDIP                         818
#define BCL1IP                        819
#define BCLIP                         820
#define CMIP                          821
#define OSCFIP                        822
#define PIE3                          823
#define RXBNIE                        824
#define CCP1IE                        825
#define RXB1IE                        826
#define CCP2IE                        827
#define TXB0IE                        828
#define TXB2IE                        829
#define TXBNIE                        830
#define TX2IE                         831
#define RC2IE                         832
#define LCDIE                         833
#define PIR3                          834
#define RXBNIF                        835
#define CCP1IF                        836
#define CCP2IF                        837
#define TXBNIF                        838
#define TX2IF                         839
#define RC2IF                         840
#define LCDIF                         841
#define IPR3                          842
#define RXBNIP                        843
#define CCP1IP                        844
#define CCP2IP                        845
#define TX2IP                         846
#define TXBNIP                        847
#define RC2IP                         848
#define LCDIP                         849
#define EECON1                        850
#define WR                            851
#define WREN                          852
#define WRERR                         853
#define FREE                          854
#define LCDCON                        855
#define LMUX0                         856
#define LMUX                          857
#define LMUX1                         858
#define CS                            859
#define CS0                           860
#define LCDCS0                        861
#define CS1                           862
#define LCDCS1                        863
#define WERR                          864
#define LCDWERR                       865
#define LCDSLPEN                      866
#define SLPEN                         867
#define LCDEN                         868
#define LCDSE0                        869
#define SE0                           870
#define SEGEN0                        871
#define SE00                          872
#define SE1                           873
#define SEGEN1                        874
#define SE01                          875
#define SE2                           876
#define SEGEN2                        877
#define SE02                          878
#define SE3                           879
#define SEGEN3                        880
#define SE03                          881
#define SE4                           882
#define SEGEN4                        883
#define SE04                          884
#define SE5                           885
#define SE05                          886
#define SEGEN5                        887
#define SE6                           888
#define SE06                          889
#define SEGEN6                        890
#define SE07                          891
#define SE7                           892
#define SEGEN7                        893
#define LCDPS                         894
#define LP                            895
#define LP0                           896
#define LCDPS0                        897
#define LP1                           898
#define LCDPS1                        899
#define LP2                           900
#define LCDPS2                        901
#define LP3                           902
#define LCDPS3                        903
#define WA                            904
#define LCDA                          905
#define BIASMD                        906
#define WFT                           907
#define RCSTA1                        908
#define RCSTA1_RX9D                   909
#define RX9D1                         910
#define RCSTA1_RCD8                   911
#define RCSTA1_OERR                   912
#define OERR1                         913
#define RCSTA1_FERR                   914
#define FERR1                         915
#define RCSTA1_ADDEN                  916
#define ADDEN1                        917
#define RCSTA1_CREN                   918
#define CREN1                         919
#define SRENA                         920
#define SREN1                         921
#define RCSTA1_SREN                   922
#define RCSTA1_NOT_RC8                923
#define RCSTA1_RC9                    924
#define RCSTA1_nRC8                   925
#define RCSTA1_RC8_9                  926
#define RCSTA1_RX9                    927
#define RX91                          928
#define RCSTA1_SPEN                   929
#define SPEN1                         930
#define TXSTA1                        931
#define TX9D1                         932
#define TXSTA1_TX9D                   933
#define TXSTA1_TXD8                   934
#define TRMT1                         935
#define TXSTA1_TRMT                   936
#define BRGH1                         937
#define TXSTA1_BRGH                   938
#define SENDB1                        939
#define SENDB                         940
#define TXSTA1_SYNC                   941
#define SYNC1                         942
#define TXEN1                         943
#define TXSTA1_TXEN                   944
#define TX91                          945
#define TXSTA1_NOT_TX8                946
#define TXSTA1_TX8_9                  947
#define TXSTA1_TX9                    948
#define TXSTA1_nTX8                   949
#define TXSTA1_CSRC                   950
#define CSRC1                         951
#define T3CON                         952
#define TMR3ON                        953
#define TMR3CS                        954
#define nT3SYNC                       955
#define NOT_T3SYNC                    956
#define T3SYNC                        957
#define T3INSYNC                      958
#define SOSCEN3                       959
#define T3CCP1                        960
#define T3CKPS                        961
#define T3CKPS0                       962
#define T3CKPS1                       963
#define T3CCP2                        964
#define T3CON_RD16                    965
#define RD163                         966
#define T3RD16                        967
#define CMCON                         968
#define CMEN0                         969
#define CMCON_CM                      970
#define CM0                           971
#define CMEN1                         972
#define CM1                           973
#define CMEN2                         974
#define CM2                           975
#define CIS                           976
#define C1INV                         977
#define C2INV                         978
#define CMCON_C1OUT                   979
#define CMCON_C2OUT                   980
#define CVRCON                        981
#define CVR                           982
#define CVR0                          983
#define CVR1                          984
#define CVR2                          985
#define CVR3                          986
#define CVRSS                         987
#define CVRR                          988
#define CVROEN                        989
#define CVROE                         990
#define CVREN                         991
#define SE08                          992
#define SE8                           993
#define SEGEN8                        994
#define LCDSE1                        995
#define SEGEN9                        996
#define SE09                          997
#define SE9                           998
#define SEGEN10                       999
#define SE10                          1000
#define SEGEN11                       1001
#define SE11                          1002
#define SEGEN12                       1003
#define SE12                          1004
#define SEGEN13                       1005
#define SE13                          1006
#define SEGEN14                       1007
#define SE14                          1008
#define SEGEN15                       1009
#define SE15                          1010
#define SEGEN16                       1011
#define LCDSE2                        1012
#define SE16                          1013
#define SEGEN17                       1014
#define SE17                          1015
#define SEGEN18                       1016
#define SE18                          1017
#define SEGEN19                       1018
#define SE19                          1019
#define SE20                          1020
#define SEGEN20                       1021
#define SE21                          1022
#define SEGEN21                       1023
#define SEGEN22                       1024
#define SE22                          1025
#define SEGEN23                       1026
#define SE23                          1027
#define SE24                          1028
#define SEGEN24                       1029
#define LCDSE3                        1030
#define SE25                          1031
#define SEGEN25                       1032
#define SE26                          1033
#define SEGEN26                       1034
#define SE27                          1035
#define SEGEN27                       1036
#define SE28                          1037
#define SEGEN28                       1038
#define SEGEN29                       1039
#define SE29                          1040
#define SE30                          1041
#define SEGEN30                       1042
#define SEGEN31                       1043
#define SE31                          1044
#define SEGEN32                       1045
#define SE32                          1046
#define LCDSE4                        1047
#define SEG0COM0                      1048
#define LCDDATA0                      1049
#define S00C0                         1050
#define S0C0                          1051
#define S01C0                         1052
#define SEG1COM0                      1053
#define S1C0                          1054
#define S02C0                         1055
#define S2C0                          1056
#define SEG2COM0                      1057
#define S03C0                         1058
#define SEG3COM0                      1059
#define S3C0                          1060
#define SEG4COM0                      1061
#define S4C0                          1062
#define S04C0                         1063
#define S5C0                          1064
#define S05C0                         1065
#define SEG5COM0                      1066
#define SEG6COM0                      1067
#define S6C0                          1068
#define S06C0                         1069
#define SEG7COM0                      1070
#define S7C0                          1071
#define S07C0                         1072
#define S08C0                         1073
#define LCDDATA1                      1074
#define S8C0                          1075
#define SEG8COM0                      1076
#define SEG9COM0                      1077
#define S09C0                         1078
#define S9C0                          1079
#define S10C0                         1080
#define SEG10COM0                     1081
#define S11C0                         1082
#define SEG11COM0                     1083
#define S12C0                         1084
#define SEG12COM0                     1085
#define S13C0                         1086
#define SEG13COM0                     1087
#define S14C0                         1088
#define SEG14COM0                     1089
#define SEG15COM0                     1090
